Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/add-react-to-a-website_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: The smallest React example looks like this:
ja: React のいちばん短い例はこのようになります：

source: It displays a heading saying "Hello, world!" on the page.
ja: これは "Hello, world!" という見出しをページに表示します。

source: Click the link above to open an online editor.
ja: 上記のリンクをクリックしてオンラインエディタを開いてください。

source: Feel free to make some changes, and see how they affect the output.
ja: 好きなように書き換えて、出力にどう影響するのかを確認してみてください。

source: Most pages in this guide will have editable examples like this one.
ja: このガイドのほとんどのページにはこのような編集可能な例が出てきます。

source: ## How to Read This Guide {#how-to-read-this-guide}
ja: <a id="how-to-read-this-guide"></a> ## このガイドの読み方 {#how-to-read-this-guide}

source: In this guide, we will examine the building blocks of React apps: elements and components.
ja: このガイドでは、React アプリケーションの構成部品である React 要素やコンポーネントの使い方を見ていきます。

source: Once you master them, you can create complex apps from small reusable pieces.
ja: 一度それらをマスターすると、小さくて再利用可能な部品から複雑なアプリケーションを作成できるようになります。

source: >Tip > >This guide is designed for people who prefer **learning concepts step by step**.
ja: >ヒント > >このガイドはコンセプトを一段階ずつ学んでいきたい人向けに構成されています。

source: If you prefer to learn by doing, check out our [practical tutorial](/tutorial/tutorial.html).
ja: 手を動かして学びたい方は[実践的なチュートリアル](/tutorial/tutorial.html)を参照してください。

source: You might find this guide and the tutorial complementary to each other.
ja: このガイドとチュートリアルは互いに相補的なものです。

source: This is the first chapter in a step-by-step guide about main React concepts.
ja: このページは、React のコンセプトをステップバイステップで学ぶためのガイドのうち最初の章です。

source: You can find a list of all its chapters in the navigation sidebar.
ja: 全ての章のリストはナビゲーション用のサイドバーにあります。

source: If you're reading this from a mobile device, you can access the navigation by pressing the button in the bottom right corner of your screen.
ja: モバイルデバイスで読んでいる場合は、画面の右下にあるボタンを押すことでナビゲーションにアクセスできます。

source: Every chapter in this guide builds on the knowledge introduced in earlier chapters.
ja: それぞれの章は、前の章までに学んだ知識を前提として構成されています。

source: **You can learn most of React by reading the “Main Concepts” guide chapters in the order they appear in the sidebar.** For example, [“Introducing JSX”](/docs/introducing-jsx.html) is the next chapter after this one.
ja: **"Main Concepts" にある章をサイドバーに並んでいる順番に読んでいくことで、React のほとんどを学ぶことができます**。例えば [“JSX の導入”](/docs/introducing-jsx.html) がこの章の次の章です。

source: ## Knowledge Level Assumptions {#knowledge-level-assumptions}
ja: ## 前提となる知識 {#knowledge-level-assumptions}

source: React is a JavaScript library, and so we'll assume you have a basic understanding of the JavaScript language.
ja: React は JavaScript ライブラリなので、JavaScript 言語の基本的な理解があることを想定しています。

source: **If you don't feel very confident, we recommend [going through a JavaScript tutorial](https://developer.mozilla.org/en-US/docs/Web/JavaScript/A_re-introduction_to_JavaScript) to check your knowledge level** and enable you to follow along this guide without getting lost.
ja: **あまり自信がない場合は、[JavaScript のチュートリアル](https://developer.mozilla.org/en-US/docs/Web/JavaScript/A_re-introduction_to_JavaScript)を一通り読んで知識レベルを確認し、**このガイドを迷わず読み進められるようにしてください。

source: It might take you between 30 minutes and an hour, but as a result you won't have to feel like you're learning both React and JavaScript at the same time.
ja: そうすれば 30 分から 1 時間ほどかかるかもしれませんが、JavaScript と React を同時に学んでいるような気分にならずにすむでしょう。

source: >Note > >This guide occasionally uses some newer JavaScript syntax in the examples.
ja: >補足 > >このガイドでは時折比較的新しい JavaScript の構文を例の中で使用しています。

source: If you haven't worked with JavaScript in the last few years, [these three points](https://gist.github.com/gaearon/683e676101005de0add59e8bb345340c) should get you most of the way.
ja: ここ数年 JavaScript を使った仕事をしていなかったという場合は、[この 3 点](https://gist.github.com/gaearon/683e676101005de0add59e8bb345340c)を理解すればだいたい理解したことになるでしょう。

source: ## Let's Get Started!
ja: ## 始めましょう！

source: Keep scrolling down, and you'll find the link to the [next chapter of this guide](/docs/introducing-jsx.html) right before the website footer.
ja: 下にスクロールすればウェブサイトのフッターのすぐ手前に[このガイドの次の章へのリンク](/docs/introducing-jsx.html)が出てきます。
